; domain
(define (domain mailfloor)
 (:requirements :strips :typing)
 (:types bay parcel carrier hand)
 (:predicates (stationed-at ?r - carrier ?x - bay)
         (posted ?o - parcel ?x - bay)
        (vacant ?r - carrier ?g - hand)
        (bearing ?r - carrier ?o - parcel ?g - hand))

   (:action walk
       :parameters  (?r - carrier ?from ?to - bay)
       :precondition (and  (stationed-at ?r ?from))
       :effect (and  (stationed-at ?r ?to)
         (not (stationed-at ?r ?from))))

   (:action collect
       :parameters (?r - carrier ?obj - parcel ?room - bay ?g - hand)
       :precondition  (and  (posted ?obj ?room) (stationed-at ?r ?room) (vacant ?r ?g))
       :effect (and (bearing ?r ?obj ?g)
        (not (posted ?obj ?room))
        (not (vacant ?r ?g))))

   (:action deposit
       :parameters (?r - carrier ?obj - parcel ?room - bay ?g - hand)
       :precondition  (and  (bearing ?r ?obj ?g) (stationed-at ?r ?room))
       :effect (and (posted ?obj ?room)
        (vacant ?r ?g)
        (not (bearing ?r ?obj ?g)))))

; problem
(define (problem gripper-2-5-4)
(:domain mailfloor)
(:objects carrier1 carrier2 - carrier
righthand1 lefthand1 righthand2 lefthand2 - hand
bay1 bay2 bay3 bay4 bay5 - bay
parcel1 parcel2 parcel3 parcel4 - parcel)
(:init
(stationed-at carrier1 bay4)
(vacant carrier1 righthand1)
(vacant carrier1 lefthand1)
(stationed-at carrier2 bay2)
(vacant carrier2 righthand2)
(vacant carrier2 lefthand2)
(posted parcel1 bay2)
(posted parcel2 bay1)
(posted parcel3 bay2)
(posted parcel4 bay2)
)
(:goal
(and
(posted parcel1 bay5)
(posted parcel2 bay4)
(posted parcel3 bay1)
(posted parcel4 bay2)
)
)
)

; plan
1. (collect carrier2 parcel1 bay2 righthand2)
   deleted: (posted parcel1 bay2) (vacant carrier2 righthand2)
   added: (bearing carrier2 parcel1 righthand2)
   goals met: 1 of 4
2. (collect carrier2 parcel3 bay2 lefthand2)
   deleted: (posted parcel3 bay2) (vacant carrier2 lefthand2)
   added: (bearing carrier2 parcel3 lefthand2)
   goals met: 1 of 4
3. (walk carrier2 bay2 bay1)
   deleted: (stationed-at carrier2 bay2)
   added: (stationed-at carrier2 bay1)
   goals met: 1 of 4
4. (deposit carrier2 parcel3 bay1 lefthand2)
   deleted: (bearing carrier2 parcel3 lefthand2)
   added: (posted parcel3 bay1) (vacant carrier2 lefthand2)
   goals met: 2 of 4
5. (walk carrier2 bay1 bay5)
   deleted: (stationed-at carrier2 bay1)
   added: (stationed-at carrier2 bay5)
   goals met: 2 of 4
6. (deposit carrier2 parcel1 bay5 righthand2)
   deleted: (bearing carrier2 parcel1 righthand2)
   added: (posted parcel1 bay5) (vacant carrier2 righthand2)
   goals met: 3 of 4
7. (walk carrier1 bay4 bay1)
   deleted: (stationed-at carrier1 bay4)
   added: (stationed-at carrier1 bay1)
   goals met: 3 of 4
8. (collect carrier1 parcel2 bay1 righthand1)
   deleted: (posted parcel2 bay1) (vacant carrier1 righthand1)
   added: (bearing carrier1 parcel2 righthand1)
   goals met: 3 of 4
9. (walk carrier1 bay1 bay4)
   deleted: (stationed-at carrier1 bay1)
   added: (stationed-at carrier1 bay4)
   goals met: 3 of 4
10. (deposit carrier1 parcel2 bay4 righthand1)
   deleted: (bearing carrier1 parcel2 righthand1)
   added: (posted parcel2 bay4) (vacant carrier1 righthand1)
   goals met: 4 of 4
